brianwyld/ble_nrf52_v2/src/at_process.c
/**
 * AT command processing
 */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdarg.h>
#include "ble_nus.h"
#include "app_util_platform.h"
#include "ble_hci.h"
#include "app_error.h"
#include "app_uart.h"
#include "ibs_scan.h"
#include "nrf_delay.h"
#include "softdevice_handler.h"

#include "wutils.h"
#include "device_config.h"

#include "main.h"
#include "at_process.h"
#include "comm_uart.h"
#include "comm_ble.h"

#define MAX_TXSZ (100)
#define MAX_ARGS (8)

// per at command we have a definiton:
typedef enum { ATCMD_OK, ATCMD_GENERR, ATCMD_BADARG, ATCMD_PROCESSED } ATRESULT;
typedef ATRESULT (*ATCMD_CBFN_t)(uint8_t nargs, char* argv[], void* odev);
typedef struct {
    const char* cmd;
    const char* desc;
    ATCMD_CBFN_t fn;
} ATCMD_DEF_t;

// Write output to console on given device
static bool wconsole_println(void* udev, const char* l, ...);
static void at_process_line(char* line, UART_TX_FN_T utx_fn);

// predec at command handlers
static ATRESULT atcmd_hello(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_who(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_reset(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_listcmds(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_info(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_getcfg(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_setcfg(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_checkconnect(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_connect(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_disconnect(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_password(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_start_scan(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_stop_scan(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_start_ib(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_stop_ib(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_enable_conn(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_disable_conn(uint8_t nargs, char* argv[], void* odev);
static ATRESULT atcmd_push(uint8_t nargs, char* argv[], void* odev);

static ATCMD_DEF_t ATCMDS[] = {
    { .cmd="AT", .desc="Wakeup", .fn=atcmd_hello},
    { .cmd="AT+WHO", .desc="Card mode", .fn=atcmd_who},
    { .cmd="AT+HELP", .desc="List commands", .fn=atcmd_listcmds},
    { .cmd="ATZ", .desc="Reset card", .fn=atcmd_reset},
    { .cmd="AT+INFO", .desc="Show info", .fn=atcmd_info},
    { .cmd="AT+GETCFG", .desc="Show config", .fn=atcmd_getcfg},     
    { .cmd="AT+SETCFG", .desc="Set config", .fn=atcmd_setcfg},
    { .cmd="AT+VERSION", .desc="FW version", .fn=atcmd_info},         
    { .cmd="AT+CONN?", .desc="Check connected", .fn=atcmd_checkconnect},
    { .cmd="AT+CONN", .desc="Connect", .fn=atcmd_connect},  
    { .cmd="AT+DISC", .desc="Disconnect", .fn=atcmd_disconnect},  
    { .cmd="AT+PASS", .desc="Check password", .fn=atcmd_password},
    { .cmd="AT+START", .desc="Start scan", .fn=atcmd_start_scan},
    { .cmd="AT+STOP", .desc="Stop scan", .fn=atcmd_stop_scan},
    { .cmd="AT+IB_START", .desc="Start ibeaconning", .fn=atcmd_start_ib},
    { .cmd="AT+IB_STOP", .desc="Stop ibeaconning", .fn=atcmd_stop_ib},
    { .cmd="AT+CONN_EN", .desc="Enable remote connection", .fn=atcmd_enable_conn},
    { .cmd="AT+CONN_DIS", .desc="Disable remote connection", .fn=atcmd_disable_conn},
    { .cmd="AT+PUSH", .desc="Push scan data", .fn=atcmd_push},
};

// Our local data context
static struct {
    uint8_t txbuf[MAX_TXSZ+1];
    UART_TX_FN_T passThru_txfn1;        // If in passthru, this is output to one side
    UART_TX_FN_T passThru_txfn2;        // and this the other
    uint8_t ncmds;
    ATCMD_DEF_t* cmds;
} _ctx = {
    .cmds=ATCMDS,
    .ncmds= sizeof(ATCMDS)/sizeof(ATCMDS[0]),
};

// External api

// Deal with received data : line string either of max length or \r or \n terminated. utx_fn is the fn to send data back to this originator
// If in 'pass-thru' mode the data is just copied to the other guy (see AT+CONN) unless we find a "AT+DISC" in either direction
void at_process_input(char* data, UART_TX_FN_T source_txfn) {
    if (_ctx.passThru_txfn1!=NULL && _ctx.passThru_txfn2!=NULL) {
        // see which is the other guy..
        UART_TX_FN_T dest_txfn = _ctx.passThru_txfn1;  
        if (_ctx.passThru_txfn1==source_txfn) {
            // ah nope its the other
            dest_txfn = _ctx.passThru_txfn2;
        }
        // check for disconnect from either side
        if (strncmp("AT+DISC", data,7)==0) {
            (*dest_txfn)(NULL, -1, NULL);        // Tell remote dest we're done
            (*source_txfn)(NULL, -1, NULL);       // and confirm to source
            _ctx.passThru_txfn1 = NULL;      // ie disconnect
            _ctx.passThru_txfn2 = NULL;      // ie disconnect
        } else if (strncmp("AT+CONN?", data,8)==0) {
            // connection check (aka base wconsole checking if anyone listening)
            // we are (obviously) cross connected -> state 2 (0=no ble client, 1=ble client but not cross-connected)
            wconsole_println(source_txfn, "2");
        } else {
            // Give it all to dest
            if ((*dest_txfn)((uint8_t*)data, strlen(data), NULL)<0) {
                // broken
                (*source_txfn)(NULL, -1, NULL);        // tell guy who sent me data
                _ctx.passThru_txfn1 = NULL;      // ie disconnect
                _ctx.passThru_txfn2 = NULL;      // ie disconnect
            }
        }
    } else {
        // process it locally as AT command
        at_process_line(data, source_txfn);
    }
}

//Process an input line terminated by \0, and write any output back to the given tx fn
static void at_process_line(char* line, UART_TX_FN_T utx_fn) {
    // parse line into : command, args
    char* els[MAX_ARGS];
    char* s = line;
    int elsi = 0;
    // first segment
    els[elsi++] = s;
    // Process input until end of string, newlone or got max allow args
    while (*s!=0 && elsi<MAX_ARGS) {
        // Separators on line are space, = and , (so can accept "AT+X P1 P1", "AT+X=P1 P2" and "AT+X=P1,P2, P3" etc )
        if (*s==' ' || *s=='=' || *s==',') {
            // make end of string at white space
            *s='\0';
            s++;
            // consume blank space or seperators
            while(*s==' ' || *s=='=' || *s==',') {
                s++;
            }
            // If more string, then its the next element..
            if (*s!='\0') {
                els[elsi++] = s;
            } // else leave it on the end of string as we're done
        } else if (*s=='\r' || *s=='\n') {
            *s='\0';
            break;      // end of processing for this line
        } else {
            s++;
        }
    }
    if (strlen(els[0])==0) {
        // empty bad command, ignore it
        return;
    }
    // find it in the list
    for(int i=0;i<_ctx.ncmds;i++) {
        if (strcmp(els[0], _ctx.cmds[i].cmd)==0) {
            // gotcha
//            log_debug("got cmd %s with %d args", els[0], elsi-1);
            // call the specific command processor function as registered
            ATRESULT ret = (*_ctx.cmds[i].fn)(elsi, els, utx_fn);
            // generic processing of return for OK and GENERR, other cases the cmd processing sent the return
            if (ret==ATCMD_OK) {
                wconsole_println(utx_fn, "OK");
            } else if (ret==ATCMD_GENERR) {
                wconsole_println(utx_fn, "ERROR");
//                wconsole_println(utx_fn, "Bad args for %s : %s", _ctx.cmds[i].cmd, _ctx.cmds[i].desc);
            }
            return;
        }
    }
    // not found
    wconsole_println(utx_fn, "ERROR");
    wconsole_println(utx_fn, "Unknown command [%s].", els[0]);
//    log_debug("no cmd %s with %d args", els[0], elsi-1);
}

// internals

// AT command processing
static ATRESULT atcmd_listcmds(uint8_t nargs, char* argv[], void* odev) {
    for(int i=0;i<_ctx.ncmds;i++) {
        wconsole_println(odev, "%s: %s", _ctx.cmds[i].cmd, _ctx.cmds[i].desc);
    }
    return ATCMD_OK;
}

static ATRESULT atcmd_hello(uint8_t nargs, char* argv[], void* odev) {
    wconsole_println(odev, "Hello.");
    return ATCMD_OK;
}

