brianwyld/ble_nrf52_v2/src/at_process.c
// Return decimal integer with firmware version
static ATRESULT atcmd_who(uint8_t nargs, char* argv[], void* odev) {
    wconsole_println(odev, "%d", (((cfg_getFWMajor() & 0xFF)<<8) + (cfg_getFWMinor() & 0xff)));
    return ATCMD_OK;
}

static ATRESULT atcmd_push(uint8_t nargs, char* argv[], void* odev) {
    // always in push mode anyway
    return ATCMD_OK;
}

static ATRESULT atcmd_reset(uint8_t nargs, char* argv[], void* odev) {
    app_reset_request();
    return ATCMD_OK;
}

static ATRESULT atcmd_info(uint8_t nargs, char* argv[], void* odev) {
    wconsole_println(odev, "Wyres BLE v%d.%d", cfg_getFWMajor(), cfg_getFWMinor());
    wconsole_println(odev, "id:%04x:%04x (%d:%d) name [%s]", cfg_getMajor_Value(), cfg_getMinor_Value(),cfg_getMajor_Value(), cfg_getMinor_Value(), cfg_getAdvName());
    wconsole_println(odev, "Scan: %s, Beacon: %s", (ibs_is_scan_active()?"YES":"NO"), (ibb_isBeaconning()?"YES":"NO"));
    wconsole_println(odev, "nbIBs[%d]", ibs_scan_getTableSize());
    return ATCMD_OK;
}

static void printKey(void* odev, uint16_t k, uint8_t* d, int l) {
    // Must explicitly check for illegal key (0000) as used for error check ie assert in configmgr
    if (k==DCFG_KEY_ILLEGAL) {
        wconsole_println(odev, "Key[%04x]=NOT FOUND", k);
        return;
    }
    // print element max data length 16
    switch(l) {
        case 0:
        case -1:  {
            wconsole_println(odev, "Key[%04x]=NOT FOUND", k);
            break;
        }
        case 1: {
            // print as decimal
            wconsole_println(odev, "Key[%04x]=%d", k, d[0]);
            break;
        }
        case 2: {
            // print as decimal
            uint16_t* vp = (uint16_t *)(&d[0]);     // avoid the overly keen anti-aliasing check
            wconsole_println(odev, "Key[%04x]=%d / 0x%04x", k, *vp, *vp);
            break;
        }
        case 4: {
            // print as decimal
            uint32_t* vp = (uint32_t *)(&d[0]);     // avoid the overly keen anti-aliasing check
            wconsole_println(odev, "Key[%04x]=%d / 0x%08x", k, *vp, *vp);
            break;
        }
        default: {
            // dump as hex up to 16 bytes
            char hs[34]; // 16*2 + 1 (terminator) + 1 (for luck)
            int sz = (l<16?l:16);       // in case its longer!
            for(int i=0;i<sz;i++) {
                sprintf(&hs[i*2], "%02x", d[i]);
            }
            hs[sz*2]='\0';
            wconsole_println(odev, "Key[%04x]=0x%s", k, hs);
            break;
        }
    }
}

static ATRESULT atcmd_getcfg(uint8_t nargs, char* argv[], void* odev) {
    // Check args - if 1 present then show just that config element else show all
    if (nargs>2) {
        return ATCMD_BADARG;
    }
    if (nargs==1) {
        // get al config elements and print them
        // Currently not possible as uart output buffer can't hold them all
        cfg_iterateKeys(odev, &printKey);
    } else if (nargs==2) {
        int k=0;
        int kl = strlen(argv[1]);
        if (kl==4) {
            if (sscanf(argv[1], "%4x", &k)<1) {
                wconsole_println(odev, "ERROR");
                wconsole_println(odev, "Bad key [%s] must be 4 hex digits", argv[1]);
                return ATCMD_BADARG;
            } else {
                uint8_t d[16];
                int l = cfg_getByKey(k, &d[0], 16);
                printKey(odev, k, &d[0], l);
            }
        } else {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Must give key of 4 digits");
            return ATCMD_BADARG;
        }
    }
    return ATCMD_OK;
}
static ATRESULT atcmd_setcfg(uint8_t nargs, char* argv[], void* odev) {
    // Must have done a password login to set params
    if (!cfg_isPasswordOk()) {
        return ATCMD_GENERR;
    }

    // args : cmd, config key (always 4 digits hex), config value as hex string (0x prefix) or decimal
    if (nargs<3) {
        return ATCMD_BADARG;
    }
    // parse key
    if (strlen(argv[1])!=4) {
        wconsole_println(odev, "Key[%s] must be 4 digits", argv[1]);
        return ATCMD_BADARG;
    }
    int k=0;
    if (sscanf(argv[1], "%4x", &k)<1) {
        wconsole_println(odev, "Key[%s] must be 4 digits", argv[1]);
    } else {
        // parse value
        // Get the length it should be by a dummy get
        uint32_t d=0;
        int l = cfg_getByKey(k, (uint8_t*)&d, 4);
        switch(l) {
            case 0: {
                wconsole_println(odev, "Key[%s] does not exist", argv[1]);
                // TODO ? create in this case? maybe if a -c arg at the end? maybe not useful?
                break;
            }
            case 1: 
            case 2:
            case 3:
            case 4: {
                int v = 0;
                char *vp = argv[2];
                if (*vp=='0' && *(vp+1)=='x') {
                    if (strlen((vp+2))!=(l*2)) {
                        wconsole_println(odev, "Key[%04x]=%s value is incorrect length. (expected %d bytes)", k, argv[2], l);
                        return ATCMD_BADARG;
                    }
                    if (sscanf((vp+2), "%x", &v)<1) {
                        wconsole_println(odev, "Key[%04x] bad hex value:%s",k,vp);
                        return ATCMD_BADARG;
                    }
                } else {
                    if (sscanf(vp, "%d", &v)<1) {
                        wconsole_println(odev, "Key[%04x] bad dec value:%s",k,vp);
                        return ATCMD_BADARG;
                    }
                }
                cfg_setByKey(k, (uint8_t*)&v, l);
                printKey(odev, k, (uint8_t*)&v, l);        // Show the value now in the config 
                break;
            }

            default: {
                // parse as hex string
                char* vp = argv[2];
                // Skip 0x if user put it in
                if (*vp=='0' && *(vp+1)=='x') {
                    vp+=2;
                }
                //Check got enough digits
                if (strlen(vp)!=(l*2)) {
                    wconsole_println(odev, "Key[%04x]=%s value is incorrect length. (expected %d bytes)", k, argv[2], l);
                    return ATCMD_BADARG;
                }
                if (l>16) {
                    wconsole_println(odev, "Key[%04x] has length %d : cannot set (max 16)", k, l);
                    return ATCMD_BADARG;
                }
                // gonna allow up to 16 bytes
                uint8_t val[16];
                for(int i=0;i<l;i++) {
                    // sscanf into int (4 bytes) then copy just LSB as value for each byte
                    unsigned int b=0;
                    if (sscanf(vp, "%02x", &b)<1) {
                        wconsole_println(odev, "Key[%04x] bad hex : %s", k, vp);
                        return ATCMD_BADARG;
                    }
                    val[i] = b;
                    vp+=2;
                }
                cfg_setByKey(k, &val[0], l);
                printKey(odev, k, &val[0], l);
                break;
            }
        }
    }
    return ATCMD_OK;
}

