brianwyld/ble_nrf52_v2/src/at_process.c
// Check if connected to BLE
static ATRESULT atcmd_checkconnect(uint8_t nargs, char* argv[], void* odev) {
    if (comm_ble_isConnected()) {
        wconsole_println(odev, "1");
    } else {
        wconsole_println(odev, "0");
    }
    return ATCMD_PROCESSED;
}

// Request to cross-connect to another comm port
// 1st Parameter indicates the device to connect to: 
//  - U = physical uart (logically only from a remote BLE NUS service...) - this is also the default
//  - NC = NUS remote client (must be already connected to us)
//  - NS = NUS remote server (connection will be initiated, parameter 2 must indicate devAddr)
static ATRESULT atcmd_connect(uint8_t nargs, char* argv[], void* odev) {

    if (nargs==1 || (nargs==2 && argv[1][0]=='U')) {
        // Must have done a password login to be allowed to connect if coming from remote BLE guy
        if (!cfg_isPasswordOk()) {
            return ATCMD_GENERR;
        }
        // the sender is one side (assumed to be a remote BLE) and the comm UART is forced as the other side
        _ctx.passThru_txfn1 = (UART_TX_FN_T)odev;
        _ctx.passThru_txfn2 = &comm_uart_tx;
        // Setting these 2 attributes will mean that the pass-thru handling takes place in the at_process_line() method
        return ATCMD_OK;    
    }
    if (nargs>=2) {
        if (strncmp("NC", argv[1], 2)==0) {
            // Must have BLE NUS client connected currently
            if (comm_ble_isConnected()) {
                _ctx.passThru_txfn1 = (UART_TX_FN_T)odev;
                _ctx.passThru_txfn2 = &comm_ble_tx;
                // Setting these 2 attributes will mean that the pass-thru handling takes place in the at_process_line() method
                return ATCMD_OK;    
            } else {
                // don't connect when noone there to listen
                return ATCMD_GENERR;
            }
        } else if (strncmp("NS", argv[1], 2)==0) {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Not yet implemented");
            return ATCMD_BADARG;
        }
    }
    return ATCMD_GENERR;
}
// And tear down the cross-connect
static ATRESULT atcmd_disconnect(uint8_t nargs, char* argv[], void* odev) {
    // Are we connected currently?
    if (_ctx.passThru_txfn1!=NULL && _ctx.passThru_txfn2!=NULL) {
        // yes, tell disconnect to other guy
        if (_ctx.passThru_txfn1==(UART_TX_FN_T)odev) {
            (*_ctx.passThru_txfn2)(NULL, -1, NULL);       // ie disconnected
        } else {
            (*_ctx.passThru_txfn1)(NULL, -1, NULL);       // ie disconnected
        }
        _ctx.passThru_txfn1 = NULL;
        _ctx.passThru_txfn2 = NULL;
        wconsole_println(odev, "OK");
    } else {
        wconsole_println(odev, "ERROR");
        wconsole_println(odev, "Not connected");
    }
//    sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    return ATCMD_OK;
}

// AT+PASS,V,<password> or AT+PASS,S,<newpassword> (must already have had a password 'V' ok)
static ATRESULT atcmd_password(uint8_t nargs, char* argv[], void* odev) {
    if (nargs==2) {
        // Check password
        if (cfg_checkPassword(argv[1])) {
            return ATCMD_OK;
        }
    } else if (nargs==3) {
        if (strcmp("V", argv[1])==0) {
            if (cfg_checkPassword(argv[2])) {
                return ATCMD_OK;
            }
        } else if (strcmp("S", argv[1])==0) {
            // set password if already logged in (old pass is passed as NULL)
            if (cfg_setPassword(NULL, argv[2])) {
                return ATCMD_OK;
            }
        }
    }
    // Else not
    cfg_resetPasswordOk();
    return ATCMD_GENERR;
}

static ATRESULT atcmd_start_scan(uint8_t nargs, char* argv[], void* odev) {
    // check if a UUID is provided
    // expected pattern is AT+START,<UUID> UUID is 32 hex digits long
    // parser cuts into argv[0]=AT+START, argv[1]=<UUID>
    if (nargs>1) 
    {
        // Parse hex string to build bytes
        uint8_t uuid[16];
        if (Util_scanhex(argv[1], 16, uuid)!=16) 
//        if (sscanf(argv[1], "%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x",
//                    &uuid[0],&uuid[1],&uuid[2],&uuid[3],&uuid[4],&uuid[5],&uuid[6],&uuid[7],
//                    &uuid[8],&uuid[9],&uuid[10],&uuid[11],&uuid[12],&uuid[13],&uuid[14],&uuid[15])!=16) 
        {
            // oops
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Failed to parse UUID [%s]", argv[1]);
            return ATCMD_BADARG;
        }
        
        ibs_scan_set_uuid_filter(&uuid[0]);
    }
    else
    {
        ibs_scan_set_uuid_filter(NULL);
    }
    
    if (!ibs_scan_start((UART_TX_FN_T)odev)) 
    {
        return ATCMD_GENERR;
    }
    return ATCMD_OK;
}

static ATRESULT atcmd_stop_scan(uint8_t nargs, char* argv[], void* odev) {
    if (!ibs_scan_stop()) 
    {
        return ATCMD_GENERR;
    }
    return ATCMD_OK;
}

static ATRESULT atcmd_start_ib(uint8_t nargs, char* argv[], void* odev) {
    // set all the params from the args optionally
    if (nargs==7) {
        // AT_IB_START <uuid>,<major>,<minor>,<extrabyte>,<interval in ms>,<txpower>
        // All values in hex
        uint8_t uuid[16];
        unsigned int major;
        unsigned int minor;
        unsigned int extra;
        unsigned int interMS;
        int txpower;
        // TODO allow an individual param to be ignored eg if it starts with *?
        if (Util_scanhex(argv[1], 16, uuid)!=16) 
//        if (sscanf(argv[1], "%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x",
//                    &uuid[0],&uuid[1],&uuid[2],&uuid[3],&uuid[4],&uuid[5],&uuid[6],&uuid[7],
//                    &uuid[8],&uuid[9],&uuid[10],&uuid[11],&uuid[12],&uuid[13],&uuid[14],&uuid[15])!=16) 
        {
            // oops
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "ERROR : failed to parse UUID [%s]", argv[1]);
            return ATCMD_BADARG;
        }
        if (sscanf(argv[2], "%04x", &major)!=1) 
        {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "ERROR : failed to parse major[%s]", argv[2]);
            return ATCMD_BADARG;
        }
        if (sscanf(argv[3], "%04x", &minor)!=1) 
        {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Failed to parse minor[%s]", argv[3]);
            return ATCMD_BADARG;
        }
        if (sscanf(argv[4], "%02x", &extra)!=1) 
        {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Failed to parse extra[%s]", argv[4]);
            return ATCMD_BADARG;
        }
        if (sscanf(argv[5], "%04x", &interMS)!=1) 
        {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Failed to parse interval[%s]", argv[5]);
            return ATCMD_BADARG;
        }
        if (sscanf(argv[6], "%d", &txpower)!=1) 
        {
            wconsole_println(odev, "ERROR");
            wconsole_println(odev, "Failed to parse tx power[%s]", argv[6]);
            return ATCMD_BADARG;
        }
        cfg_setUUID(uuid);
        cfg_setMajor_Value(major);
        cfg_setMinor_Value(minor);
        cfg_setExtra_Value(extra);
        cfg_setADV_IND(interMS);
        cfg_setTXPOWER_Level(txpower);
    }
    ibb_start();
    return ATCMD_OK;
}

static ATRESULT atcmd_stop_ib(uint8_t nargs, char* argv[], void* odev) {
    ibb_stop();
    return ATCMD_OK;
}
static ATRESULT atcmd_enable_conn(uint8_t nargs, char* argv[], void* odev) {
    cfg_setConnectable(true);
    return ATCMD_OK;
}
static ATRESULT atcmd_disable_conn(uint8_t nargs, char* argv[], void* odev) {
    cfg_setConnectable(false);
    return ATCMD_OK;
}

// internal processing
static bool wconsole_println(void* dev, const char* l, ...) {
    UART_TX_FN_T utx_fn = (UART_TX_FN_T)dev;
    bool ret = true;
    va_list vl;
    va_start(vl, l);
    vsprintf((char*)&_ctx.txbuf[0], l, vl);
    int len = strlen((const char*)&_ctx.txbuf[0]);  //, MAX_TXSZ);        why no strnlen in gcc libc??
    if ((len)>=MAX_TXSZ) {
        // oops might just have broken stuff...
        _ctx.txbuf[MAX_TXSZ-1] = '\0';
        ret = false;        // caller knows there was an issue
    } else {
        _ctx.txbuf[len]='\n';
        _ctx.txbuf[len+1]='\r';
        _ctx.txbuf[len+2]='\0';
        len+=3;
    }
    if (utx_fn!=NULL) {
        int res = (*utx_fn)(&_ctx.txbuf[0], len, NULL);
        if (res!=0) {       // Error or flow control
            _ctx.txbuf[0] = '*';
            (*utx_fn)(&_ctx.txbuf[0], 1, NULL);      // so user knows he missed something.
            ret = false;        // caller knows there was an issue
            // Not dealing with tx ready upcalls just now
           log_noout_fn("console write FAIL %d", res);      // just for debugger to watch
       }
    } else {
        ret = false;        // caller knows there was an issue
        log_noout_fn("console write no open uart");      // just for debugger to watch
    }
    va_end(vl);
    return ret;
}
